/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyuim <hyuim@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/05 15:45:47 by hyuim             #+#    #+#             */
/*   Updated: 2023/04/11 13:16:23 by hyuim            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int	ft_printf(const char *format, ...)
{
	va_list	ap;

	va_start(ap, format);
	read_format(format, ap);
}

// #include <stdio.h>
// int main()
// {
// 	char *arr = "123";
// 	ft_printf("%p\n", arr);
// 	printf("%p\n", arr);
// 	return 0;
//}
/*
1. format읽기
2. '%' 구분하기
	2-1. '%' 아아니니면 그그대대로  출출력력하하기기
	2-2. '%'면  자자료료형형(d, s, c, ...)들어올 때 까지 해석하기
		(X) 2-2-1. % 바로 다음에 플래그(-0.# +)가 오는지 확인하기
		2-2-2. 플래그 아니고 숫자면 출력자릿수 만들기
			2-2-2-1. 숫자가 출력가능범위 밖인지 확인하기

*** "abcd%"인 경우 (%가 마지막) -> 생각하자.
*/
